АлогистикТест2/src/Documents/алк_УстановкаЦенПоЗаказу/алк_УстановкаЦенПоЗаказу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаЦенПоЗаказу</name>
  <basedOn>Document.алк_ЗаказПокупателя</basedOn>
  <registerRecords>InformationRegister.алк_ЦеныПродукции</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапасыМассив</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыАссортимент</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_УстановкаЦенПоЗаказу/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУстановкаЦенПоЗаказу, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Номенклатура,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Ссылка.Заказ КАК Заказ,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Ссылка.Организация,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Характеристика,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Цена,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.ПредставлениеСтроки КАК ПредставлениеТовара
		|ИЗ
		|	Документ.алк_УстановкаЦенПоЗаказу.ЗапасыАссортимент КАК алк_УстановкаЦенПоЗаказуЗапасыАссортимент
		|ГДЕ
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУстановкаЦенПоЗаказу);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаУстановкаЦенПоЗаказу.Дата);
				
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЦеныПродукции", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли
